app/controllers/todos_controller.rb

  def show
    todo = current_user.todo.find_by(id: params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    todo = Todo.new(
      todo_text: params[:todo_text],
      due_date: params[:due_date],
      user_id: current_user.id,
      completed: false,
    )
    # Run validations
    if (!todo.save)
---
INSERT INTO "todos" ("todo_text", "due_date", "completed", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["todo_text", "aa"], ["due_date", "2021-02-09"], ["completed", false], ["created_at", "2021-02-05 21:21:58.928003"], ["updated_at", "2021-02-05 21:21:58.928003"], ["user_id", 13]]

  def update
    todo = current_user.todo.find_by(id: params[:id])
    if (todo)
      todo.completed = params[:completed]
      todo.save!
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = $1 AND "todos"."id" = $2 LIMIT $3  [["user_id", 15], ["id", 24], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["completed", true], ["updated_at", "2021-02-05 21:56:35.606057"], ["id", 24]]

  def destroy
    todo = current_user.todo.find_by(id: params[:id])
    if (todo)
      todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = $1 AND "todos"."id" = $2 LIMIT $3  [["user_id", 15], ["id", 24], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 24]]