app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."firstname" ASC
---
  def index
    # GET /users
    render plain: User.order(:firstname).
             map(&:to_pleasant_string).
             join("\n")