app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def index
    render plain: User.order(:name).
             map(&:to_pleasant_string).
             join("\n")

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Claire"], ["email", "claire@hotmail.com"], ["password", "hello123"], ["created_at", "2021-01-22 21:39:15.144568"], ["updated_at", "2021-01-22 21:39:15.144568"]]
---
  def create
    new_user = User.create(
      name: params[:name],
      email: params[:email],
      password: params[:password],
    )

SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT $3  [["email", "ben@yahoo.com"], ["password", "hello123"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(
      email: params[:email],
      password: params[:password],
    )